In [40]:
import pandas as pd
#import pandas.io.sql as sqlio
#import sqlalchemy as sql
import psycopg2
#import matplotlib.pyplot as plt
import numpy as np
import os

from dotenv import load_dotenv
#from matplotlib import colors
#from matplotlib.ticker import PercentFormatter
   
from sqlalchemy import create_engine

# load up the variables from the .env file.
load_dotenv()

True

### States Abbreviation Table

In [41]:
# File to Load (Remember to Change These)
file_to_load = "Resources/StatetoAbbrev.csv"
states_data = pd.read_csv(file_to_load)
states_data.head()

        State  Abbrev Code
0     Alabama    Ala.   AL
1      Alaska  Alaska   AK
2     Arizona   Ariz.   AZ
3    Arkansas    Ark.   AR
4  California  Calif.   CA

In [42]:
states_data['id']=states_data.index+1
states_data.head()

        State  Abbrev Code  id
0     Alabama    Ala.   AL   1
1      Alaska  Alaska   AK   2
2     Arizona   Ariz.   AZ   3
3    Arkansas    Ark.   AR   4
4  California  Calif.   CA   5

### Renewable Potential energy

In [58]:
# File to Load (Remember to Change These)
file_to_load = "Resources/usretechnicalpotential.csv"

# Read Renewable energy potential file and store into Pandas data frame
renewable_energy_data = pd.read_csv(file_to_load)
renewable_energy_data.columns

Index(['Unnamed: 0', 'urbanUtilityScalePV_GWh', 'urbanUtilityScalePV_GW',
       'urbanUtilityScalePV_km2', 'ruralUtilityScalePV_GWh',
       'ruralUtilityScalePV_GW', 'ruralUtilityScalePV_km2', 'rooftopPV_GWh',
       'rooftopPV_GW', 'CSP_GWh', 'CSP_GW', 'CSP_km2', 'onshoreWind_GWh',
       'onshoreWind_GW', 'onshoreWind_km2', 'offshoreWind_GWh',
       'offshoreWind_GW', 'offshoreWind_km2', 'biopowerSolid_GWh',
       'biopowerSolid_GW', 'biopowerSolid_BDT', 'biopowerGaseous_GWh',
       'biopowerGaseous_GW', 'biopowerGaseous_Tonnes-CH4',
       'geothermalHydrothermal_GWh', 'geothermalHydrothermal_GW',
       'EGSGeothermal_GWh', 'EGSGeothermal_GW', 'hydropower_GWh',
       'hydropower_GW', 'hydropower_countOfSites'],
      dtype='object')

In [59]:
renewable_energy_data.rename(columns={'Unnamed: 0' : 'State'}, inplace=True)
bio_power_potential = renewable_energy_data[['State', 'biopowerSolid_GWh', 'biopowerGaseous_GWh']]
bio_power_potential.head()

        State  biopowerSolid_GWh  biopowerGaseous_GWh
0     Alabama              11193                 1533
1      Alaska                513                   61
2     Arizona               1087                  837
3    Arkansas              14381                 1063
4  California              12408                15510

In [64]:
n = len(states_data.index)
m = len(bio_power_potential.index)
print(n==m)
for i in range(n):
    if states_data.loc[i,'State'] != bio_power_potential.loc[i, 'State']:
        print(i, states_data.loc[i,'State'], bio_power_potential.loc[i, 'State'])

True

In [62]:
bio_power_potential['State_id'] = bio_power_potential.index+1
bio_power = bio_power_potential.drop(columns=['State'])
bio_power.set_index('State_id', inplace=True)
bio_power.head()

/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

          biopowerSolid_GWh  biopowerGaseous_GWh
State_id
1                     11193                 1533
2                       513                   61
3                      1087                  837
4                     14381                 1063
5                     12408                15510

### Total Net electricity

In [48]:
# File to Load (Remember to Change These)
file_to_load = "Resources/Total Net Electricity Generation-StateRankings.csv"

# Read Renewable energy potential file and store into Pandas data frame
total_electricity_data = pd.read_csv(file_to_load)
total_electricity_data.head()

,Rank,State,"Total Net Electricity Generation, thousand MWh",Note: Rankings are based on the full source data values.
0,1,TX,38524,NaN
1,2,FL,20787,NaN
2,3,PA,16521,NaN
3,4,CA,15465,NaN
4,5,IL,12997,NaN

In [70]:
total_electricity = total_electricity_data.drop(columns='Note: Rankings are based on the full source data values.')
total_electricity.rename(columns={'Total Net Electricity Generation, thousand MWh': 'Total_Net(GWh)'}, inplace=True)
total_electricity.head()

   Rank State  Total_Net(GWh)
0     1    TX           38524
1     2    FL           20787
2     3    PA           16521
3     4    CA           15465
4     5    IL           12997

In [71]:
combined_df = pd.merge(states_data,total_electricity,how='outer', left_on='Code', right_on='State')
combined_df.head()

      State_x  Abbrev Code  id  Rank State_y  Total_Net(GWh)
0     Alabama    Ala.   AL   1     7      AL           10575
1      Alaska  Alaska   AK   2    48      AK             476
2     Arizona   Ariz.   AZ   3    10      AZ            9350
3    Arkansas    Ark.   AR   4    31      AR            3532
4  California  Calif.   CA   5     4      CA           15465

In [72]:
n = len(combined_df.index)
for i in range(n):
    if combined_df.loc[i,'Code'] != combined_df.loc[i, 'State_y']:
        print(i, combined_df.loc[i,'Code'], combined_df.loc[i, 'State_y'])

In [76]:
total_electricity_df = combined_df[['id', 'Rank', 'Total_Net(GWh)']].rename(columns={'id':'State_id'})
total_electricity_df.set_index('State_id', inplace=True)
total_electricity_df.head()

          Rank  Total_Net(GWh)
State_id
1            7           10575
2           48             476
3           10            9350
4           31            3532
5            4           15465

In [9]:
# set the variables for the pull from SQL.  username and password are in an .env file.  You will need those to make this run
# on your machine.

host = 'localhost'
port = 5432
dbname='ETL_Project'
username = os.environ.get('USER_NAME')
pwd = os.environ.get('PASSWORD')

In [23]:
# set up the connection to the database "ETL_Project"
connection_string = f'{username}:{pwd}@{host}:{port}/{dbname}'
engine = create_engine(f'postgresql://{connection_string}')

In [24]:
engine.table_names()

[]

In [6]:
# set up the connection to the database "ETL_Project"
"""
conn = psycopg2.connect("host='{}' port={} dbname='{}' user={} password={}".format(host, port, dbname, username, pwd))
sql = "SQL statement"
dat = sqlio.read_sql_query(sql, conn)"""

DatabaseError: Execution failed on sql 'SQL statement': syntax error at or near "SQL"
LINE 1: SQL statement
        ^